Tekla.Structures.Model.ControlObjectLineType
The line types (the presentation of the line).

Tekla.Structures.Model.ControlObjectLineType.SolidLine
The solid line (default).

Tekla.Structures.Model.ControlObjectLineType.DashedLine
The dashed line (-----).

Tekla.Structures.Model.ControlObjectLineType.SlashedLine
The slashed line (- - -).

Tekla.Structures.Model.ControlObjectLineType.DashDot
The dash dotted line (--.--.).

Tekla.Structures.Model.ControlObjectLineType.DottedLine
The dotted line (.....).